CSI API ETABS v1
eFrameDesignOrientation Enumeration
 The possible design orientations for a frame.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eFrameDesignOrientation
Public Enumeration eFrameDesignOrientation
Dim instance As eFrameDesignOrientation
public enum class eFrameDesignOrientation
type eFrameDesignOrientation
Members
Member name | Value | Description
Column | 1
Beam | 2
Brace | 3
Null | 4
Other | 5
Remarks
See Also
Reference
ETABSv1 Namespace